https://leetcode.com/problems/department-top-three-salaries/

In [1]:
%load_ext sql

In [2]:
import sqlalchemy 

#sqlalchemy.create_engine('mysql://root:root@localhost', echo=True)

Engine(mysql://root:***@localhost)

In [3]:
%sql mysql://root:root@localhost

In [4]:
%%sql 

##create schema 185_db;
use 185_db;

Create table If Not Exists Employee(Id int primary key, Name varchar(255), Salary int, DepartmentId int);
Create table If Not Exists Department(Id int primary key, Name varchar(255));

Truncate table Employee;
insert into Employee (Id, Name, Salary, DepartmentId) values ('1', 'Joe', '85000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('2', 'Henry', '80000', '2');
insert into Employee (Id, Name, Salary, DepartmentId) values ('3', 'Sam', '60000', '2');
insert into Employee (Id, Name, Salary, DepartmentId) values ('4', 'Max', '90000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('5', 'Janet', '69000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('6', 'Randy', '85000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('7', 'Will', '70000', '1');
Truncate table Department;
insert into Department (Id, Name) values ('1', 'IT');
insert into Department (Id, Name) values ('2', 'Sales');

 * mysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

C:\ProgramData\Anaconda3\lib\site-packages\sqlalchemy\engine\default.py:717: Warning: (1050, "Table 'employee' already exists")
  cursor.execute(statement, parameters)
C:\ProgramData\Anaconda3\lib\site-packages\sqlalchemy\engine\default.py:717: Warning: (1050, "Table 'department' already exists")
  cursor.execute(statement, parameters)

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
show tables;

 * mysql://root:***@localhost
2 rows affected.

[('department',), ('employee',)]

In [6]:
%%sql
select * from employee;

 * mysql://root:***@localhost
7 rows affected.

[(1, 'Joe', 85000, 1),
 (2, 'Henry', 80000, 2),
 (3, 'Sam', 60000, 2),
 (4, 'Max', 90000, 1),
 (5, 'Janet', 69000, 1),
 (6, 'Randy', 85000, 1),
 (7, 'Will', 70000, 1)]

In [7]:
%%sql
select * from department;

 * mysql://root:***@localhost
2 rows affected.

[(1, 'IT'), (2, 'Sales')]

In [8]:
%%sql

select distinct(salary), name, departmentid from employee
order by salary desc;

## this will give us ordering ind desc order over all the salaries, we want only the top3 distinct salaries for each dept.

 * mysql://root:***@localhost
7 rows affected.
0 rows affected.

[]

In [9]:
%%sql

select name, departmentid, salary, row_number() over(partition by departmentid) as "row_number"
from employee 
order by salary desc

 * mysql://root:***@localhost
7 rows affected.

[('Max', 1, 90000, 2),
 ('Joe', 1, 85000, 1),
 ('Randy', 1, 85000, 4),
 ('Henry', 2, 80000, 1),
 ('Will', 1, 70000, 5),
 ('Janet', 1, 69000, 3),
 ('Sam', 2, 60000, 2)]

In [69]:
%%sql

with top3_unique_salaries as (select t.id, t.name, t.department, 
t.salary, dense_rank() over(partition by t.department order by t.salary desc) as rank_dept_salary, 
sum(t.salary) over(partition by t.department) as dept_total_salary
from 
(select t1.id, t1.name, t1.salary, t2.name as department 
from employee t1
join department t2
where t1.departmentid = t2.id) t)

select id, name, department, salary, rank_dept_salary, dept_total_salary
from top3_unique_salaries
where rank_dept_salary <=3

 * mysql://root:***@localhost
6 rows affected.

[(4, 'Max', 'IT', 90000, 1, Decimal('399000')),
 (1, 'Joe', 'IT', 85000, 2, Decimal('399000')),
 (6, 'Randy', 'IT', 85000, 2, Decimal('399000')),
 (7, 'Will', 'IT', 70000, 3, Decimal('399000')),
 (2, 'Henry', 'Sales', 80000, 1, Decimal('140000')),
 (3, 'Sam', 'Sales', 60000, 2, Decimal('140000'))]

## Observation, when we do partition by on a column automatically the entire table is distributed based on the partition condition. Thus, if we are partitioning on the same column there is no need of two over commands. Thus, the above select statement will be modified to below and also we do not need it in the Q:

In [71]:
%%sql

with top3_unique_salaries as (select t.name, t.department, 
t.salary, dense_rank() over(partition by t.department order by t.salary desc) as rank_dept_salary
from 
(select t1.id, t1.name, t1.salary, t2.name as department 
from employee t1
join department t2
where t1.departmentid = t2.id) t)

select  department as Department, name as Employee, salary
from top3_unique_salaries
where rank_dept_salary <=3

 * mysql://root:***@localhost
6 rows affected.

[('IT', 'Max', 90000),
 ('IT', 'Joe', 85000),
 ('IT', 'Randy', 85000),
 ('IT', 'Will', 70000),
 ('Sales', 'Henry', 80000),
 ('Sales', 'Sam', 60000)]